//////////////////////////////////////////////////////

/* extern int a;

 Ключевое слово extern как раз и позволяет сказать компилятору,
что переменную нужно только объявить, при этом не нужно выделять под нее память -
память под нее должна быть выделена в другом месте (возможно даже в другом файле).*/ 

//////////////////////////////////////////////////////

/* #include "head_file.h" */

//////////////////////////////////////////////////////

/* #include <iostream>
using namespace std;

int main()
{
    std::cout << "Hello, World!\n";

    int a=0; int b=0; 
    cin >> a >> b;

    cout<< "a+b="<<(a+b)<< endl;

    return 0;
} */

//////////////////////////////////////////////////////

/*
int a = 10; // a = 10
int b = ++a; // префиксный инкремент возвращает новое значение => b = 11 и a = 11
int c = a++; // постфиксный инкремент возвращает старое значение => с = 11 и a = 12 */

//////////////////////////////////////////////////////

// do { /* code */ } while(false); // тело цикла выполнится ровно один раз 

//////////////////////////////////////////////////////

/* int power(int x, unsigned p) {
    int answer = 1;
    for (int i = 0; i < p; i++) {
        answer *= x; 
    }
    return answer;
}

int power(int x, unsigned p) {
    if (p == 0) return 1;
    else if (p == 1) return x;
    else return x * power(x, --p);
} */

//////////////////////////////////////////////////////

/* #include <iostream>
using namespace std;
int main()
{
	char c = '\0';
	while (cin.get(c))
	{
		cout << c;
		if (c == ' ')
		{
			while (cin.get(c))
			{
				if (c == ' ') {continue;}
				else {cout << c; break;}

			}

		}
	}
}*/

//////////////////////////////////////////////////////